app/views/home/index.html.slim

.movies-wrapper
  - @movies.includes(:votes, :user).each do |movie|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
SELECT `votes`.* FROM `votes` WHERE `votes`.`movie_id` IN (1, 2, 3)

    - vote_downs = movie.votes.select(&:down?).to_a
    - vote_up = vote_ups.find { |v| v.user_id == current_user&.id }
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1