app/controllers/home_controller.rb

SELECT COUNT(*) FROM `movies`
SELECT `movies`.* FROM `movies` LIMIT 10 OFFSET 0
---
  def index
    page = params[:page] || 1
    per_page = params[:per_page] || 5

    @movies = Movie.page(page).per(per_page)