app/controllers/movies_controller.rb

  def create
    @movie = current_user.movies.build
    handle_params(@movie, normalize_parameters)
    if @movie.save
---
INSERT INTO `movies` (`user_id`, `title`, `description`, `thumb_url`, `video_id`, `created_at`, `updated_at`) VALUES (1, 'Thầm Thương Trộm Nhớ Em Vẫn Ngẩn Ngơ Đợi Chờ Remix - Anh Thôi Nhân Nhượng Remix (Kiều Chi Cover)', 'Thầm Thương Trộm Nhớ Em Vẫn Ngẩn Ngơ Đợi Chờ Remix - Anh Thôi Nhân Nhượng Remix (Kiều Chi Cover)📩 Mọi thông tin liên hệ tại: memevn.media@gmail.com© Bản quy...', 'https://i.ytimg.com/vi/6InSOTTB4mo/mqdefault.jpg', '6InSOTTB4mo', '2024-07-08 08:14:18.651127', '2024-07-08 08:14:18.651127')