app/controllers/votes_controller.rb

  def create
    @vote = current_user.votes.new(normalize_parameters)

    if @vote.save
---
INSERT INTO `votes` (`user_id`, `movie_id`, `created_at`, `updated_at`) VALUES (1, 1, '2024-07-08 09:40:05.273016', '2024-07-08 09:40:05.273016')

  def destroy
    @vote = current_user.votes.find_by(id: params[:id])

    if @vote.destroy
---
SELECT `votes`.* FROM `votes` WHERE `votes`.`user_id` = 1 AND `votes`.`id` = 1 LIMIT 1
DELETE FROM `votes` WHERE `votes`.`id` = 1